{
  "databaseName": "Section 2: Data Ingestion and Storage",
  "questionsWithAnswers": [
    {
      "questionId": null,
      "questionText": "What are the three main types of data formats?",
      "answerText": "Structured (database, CSV, SQL Table, spreadsheet), Unstructured (text, video/audio, image, emails - requires preprocessing), and Semi-Structured (JSON, XML, YAML, log files, email header records - structure may be inconsistent)",
      "tags": ["data-formats", "structured", "unstructured", "semi-structured"],
      "domains": ["data-ingestion", "data-storage"]
    },
    {
      "questionId": null,
      "questionText": "What are the three V's of data properties?",
      "answerText": "Volume (size/amount - GB, TB, PB), Velocity (how fast - batch, real-time, near real-time), and Variety (structured/unstructured, sources like API, stream, human input, electronic devices)",
      "tags": ["data-properties", "volume", "velocity", "variety"],
      "domains": ["data-ingestion"]
    },
    {
      "questionId": null,
      "questionText": "What is the key difference between Data Warehouse and Data Lake in terms of schema?",
      "answerText": "Data Warehouse uses Schema-on-Write (transform data to meet schema requirements - ETL), while Data Lake uses Schema-on-Read (extract then transform - ELT). Applied structure happens AFTER the fact in Data Lake.",
      "tags": ["data-warehouse", "data-lake", "schema", "etl", "elt"],
      "domains": ["data-storage", "data-architecture"]
    },
    {
      "questionId": null,
      "questionText": "What data types do Data Warehouse and Data Lake support?",
      "answerText": "Data Warehouse is for structured data. Data Lake supports structured, unstructured, and semi-structured data.",
      "tags": ["data-warehouse", "data-lake", "data-types"],
      "domains": ["data-storage"]
    },
    {
      "questionId": null,
      "questionText": "What is Data Mesh?",
      "answerText": "Data Mesh is a concept (not a topology) where individual tenants own their own data within a domain. The tenant manages data collection, transformation, and augmentation. It's domain-based data management with centralized standards, featuring federated governance with centralized standards and self-service tooling.",
      "tags": ["data-mesh", "data-governance", "domain-based"],
      "domains": ["data-architecture"]
    },
    {
      "questionId": null,
      "questionText": "What does ETL stand for and what are the three stages?",
      "answerText": "ETL stands for Extract, Transform, Load. Extract: fetch data (API, disk, etc), ensure data integrity, handle velocity (real-time, streaming, batch). Transform: convert from source to target, clean, enrich, aggregate, calculate, handle encoding/decoding, missing data. Load: move to target, velocity affects load strategy, ensure integrity and error detection.",
      "tags": ["etl", "extract", "transform", "load"],
      "domains": ["data-pipeline"]
    },
    {
      "questionId": null,
      "questionText": "What are the main ETL/ELT Pipeline Orchestration Services in AWS?",
      "answerText": "Event Bridge, Step Functions, Glue Workflow, and AWS Managed Workflow / Apache Airflow (MWAA). Glue is considered reliable for pipeline management.",
      "tags": [
        "orchestration",
        "event-bridge",
        "step-functions",
        "glue",
        "mwaa"
      ],
      "domains": ["data-pipeline", "aws-services"]
    },
    {
      "questionId": null,
      "questionText": "What is the difference between JDBC and ODBC?",
      "answerText": "JDBC (Java Database Connectivity) is Platform Independent but Language Dependent (Java). ODBC (Open Database Connectivity) is Platform Dependent (drivers for many languages) but Language Independent.",
      "tags": ["jdbc", "odbc", "database-connectivity"],
      "domains": ["data-sources"]
    },
    {
      "questionId": null,
      "questionText": "What is AVRO format and when should it be used?",
      "answerText": "AVRO is a binary format that stores data with schema. It's flexible for data and schema. Use for: big data, real-time data, schema evolution, efficient serialization. Systems: Kafka, Spark, Flink, Hadoop.",
      "tags": ["avro", "data-format", "serialization"],
      "domains": ["data-formats"]
    },
    {
      "questionId": null,
      "questionText": "What is Parquet format and when should it be used?",
      "answerText": "Parquet is a column storage format optimized for analysis with efficient compression/decompression. Use for: analyzing large datasets, reading columns instead of records, storing on distributed systems where IO is optimized. Systems: Hadoop, Spark, Hive, Impala, Redshift Spectrum.",
      "tags": ["parquet", "data-format", "column-storage"],
      "domains": ["data-formats", "analytics"]
    },
    {
      "questionId": null,
      "questionText": "What is the maximum file size for S3 objects and what is required for files larger than 5GB?",
      "answerText": "Maximum file size is 5TB. Files greater than 5GB must use multi-part uploads.",
      "tags": ["s3", "object-size", "multi-part-upload"],
      "domains": ["s3", "aws-storage"]
    },
    {
      "questionId": null,
      "questionText": "What is the difference between S3 Object Key, Prefix, and Object Value?",
      "answerText": "Object Key is the full path (e.g., s3://bucket-name/the/path/to/item.ext). Prefix is the path portion (\"/the/path/to/\"). Object Value is the contents of the file. There are no actual directories in S3, but the UI creates the appearance of folders.",
      "tags": ["s3", "object-key", "prefix"],
      "domains": ["s3"]
    },
    {
      "questionId": null,
      "questionText": "At what level is S3 versioning enabled and what are its best practices?",
      "answerText": "S3 versioning is enabled at the bucket level. Best practices include: prevents unintentional overwrite and easy rollback. Two objects with the same key will overwrite but also increment version. versionId is null for items created before versioning was enabled.",
      "tags": ["s3", "versioning", "bucket"],
      "domains": ["s3"]
    },
    {
      "questionId": null,
      "questionText": "What are the two types of S3 Replication and what are their use cases?",
      "answerText": "Cross Region Replication (CRR) for compliance, lower latency, cross-account replication. Same Region Replication (SRR) for log aggregation and prod/dev replication. Replication is async, requires versioning, can be cross-account, and ONLY WORKS FOR NEW ITEMS.",
      "tags": ["s3", "replication", "crr", "srr"],
      "domains": ["s3"]
    },
    {
      "questionId": null,
      "questionText": "What are the S3 Storage Classes and their availability percentages?",
      "answerText": "Standard (GP) - 99.99% availability, Standard Infrequent Access (IA) - 99.9%, OneZone Infrequent Access (1ZIA) - 99.5%, Glacier Instant Retrieval, Glacier Flexible Retrieval, Glacier Deep Archive. All have 11-9's durability (same for all classes).",
      "tags": ["s3", "storage-classes", "availability", "durability"],
      "domains": ["s3"]
    },
    {
      "questionId": null,
      "questionText": "What is S3 Intelligent Tiering and how does it work?",
      "answerText": "S3 Intelligent Tiering allows automatic movement between tiers with a small moving fee and no retrieval fee. Default is frequent access. Moves to infrequent after 30 days, archive instant access after 90 days, archive slower access after 90-700 days, and deep archive after 180-700+ days.",
      "tags": ["s3", "intelligent-tiering", "lifecycle"],
      "domains": ["s3"]
    },
    {
      "questionId": null,
      "questionText": "What are S3 Life Cycle Rules and what are the two types of actions?",
      "answerText": "Life Cycle Rules automatically move objects between tiers or delete them. Transition Actions move from tier to tier (e.g., after 60 days, after 6 months to Glacier). Expiration Actions delete objects (e.g., delete logs after 365 days, delete old versions, clean up incomplete multi-part uploads after 2 weeks). Rules can be created for prefix or tags.",
      "tags": ["s3", "lifecycle", "transition", "expiration"],
      "domains": ["s3"]
    },
    {
      "questionId": null,
      "questionText": "What services can receive S3 Event Notifications and what is special about EventBridge?",
      "answerText": "S3 events can be sent to SNS, SQS, Lambda, or EventBridge. EventBridge can send to 18 other services, allows advanced filtering (match metadata like object size, file name), and supports replay. You must create resource policies to allow S3 to write to these services.",
      "tags": [
        "s3",
        "event-notifications",
        "sns",
        "sqs",
        "lambda",
        "eventbridge"
      ],
      "domains": ["s3", "event-driven"]
    },
    {
      "questionId": null,
      "questionText": "What are the S3 performance limits per prefix?",
      "answerText": "Up to 3500 requests/second for PUT/COPY/POST/DELETE (write) and 5500 requests/second for GET/HEAD (read). S3 performance is measured by prefix, not bucket. You can double throughput by using multiple prefixes. There is no limit to the number of prefixes per bucket.",
      "tags": ["s3", "performance", "prefix", "throughput"],
      "domains": ["s3"]
    },
    {
      "questionId": null,
      "questionText": "What are the four types of S3 encryption methods?",
      "answerText": "SSE-S3 (Standard AWS Management, encrypted with no key specified, managed by AWS), SSE-KMS (AWS Key Management, uses AWS Key Manager, client specifies key, logged in CloudTrail), SSE-C (Customer Provided Key, client manages key, sent in header with every request, HTTPS only), and Client Side Encryption (client encrypts/decrypts on their side, sends/receives encrypted object).",
      "tags": ["s3", "encryption", "sse-s3", "sse-kms", "sse-c"],
      "domains": ["s3", "security"]
    },
    {
      "questionId": null,
      "questionText": "What is evaluated first: Bucket Policy or Encryption Policy?",
      "answerText": "Bucket Policy is evaluated before encryption policy. This is an EXAM topic.",
      "tags": ["s3", "bucket-policy", "encryption-policy"],
      "domains": ["s3", "security"]
    },
    {
      "questionId": null,
      "questionText": "What are S3 Access Points and how do they provide security?",
      "answerText": "Access Points serve as aliases for bucket prefixes. Each Access Point has its own DNS name, its own policy, and manages security at scale. AP Policy looks the same as S3 policy. Access Points can serve as a level of different security - S3 bucket can be less restrictive while S3 Access Point can be more restrictive, allowing different security settings for different users/groups.",
      "tags": ["s3", "access-points", "security"],
      "domains": ["s3", "security"]
    },
    {
      "questionId": null,
      "questionText": "What is S3 Object Lambda?",
      "answerText": "S3 Object Lambda sits between Bucket and Access Point and acts as a transformation layer. You can have several Access Points calling different Lambda functions to transform data differently. Origin data remains unchanged but provides different 'views' of the data.",
      "tags": ["s3", "object-lambda", "transformation"],
      "domains": ["s3"]
    },
    {
      "questionId": null,
      "questionText": "What are the key characteristics of EBS (Elastic Block Storage)?",
      "answerText": "EBS Volume is a network volume where data persists after instances are terminated. Mostly one instance at a time (1:1), though advanced techniques allow multiple instances (out of scope). Bound to one AZ, can make snapshot and transport to other AZ. Can be detached/attached to instances for fault tolerance. Allocated in size and/or IOPS, billed for allocated not used. Default: root drive (drv0) auto-deletes, others (drv1) do not, but this can be overridden.",
      "tags": ["ebs", "elastic-block-storage", "az", "snapshot"],
      "domains": ["ebs", "aws-storage"]
    },
    {
      "questionId": null,
      "questionText": "What is Elastic Volume and what can be changed?",
      "answerText": "Elastic Volume can change attributes on the fly: IOPS and volume type. It cannot decrease size.",
      "tags": ["ebs", "elastic-volume", "iops"],
      "domains": ["ebs"]
    },
    {
      "questionId": null,
      "questionText": "What are the key characteristics of EFS (Elastic File System)?",
      "answerText": "EFS is a managed network file system supporting multiple EC2 instances across multiple AZs. Highly available and scalable, 3x the cost of GP2, pay per use/access (not allocated). Use cases: WordPress, web server, data share. Uses NFSv4.1 Protocol, not Windows compatible (AMI). Uses Security Groups to control access, KMS for encryption at rest, POSIX file system. Automatically scales (careful of cost), supports 1000's of clients, 10 GB+/s throughput, can grow to petabyte.",
      "tags": ["efs", "elastic-file-system", "nfs", "posix"],
      "domains": ["efs", "aws-storage"]
    },
    {
      "questionId": null,
      "questionText": "What are the EFS Storage Classes?",
      "answerText": "Standard (frequent use), Infrequent Access (cost to retrieve, lower price to start), Archive (rarely accessed, few times a year, 50% cheaper). Implement lifecycle policy to move files between tiers. Standard supports multi-AZ, supports 1Z for dev work.",
      "tags": ["efs", "storage-classes", "lifecycle"],
      "domains": ["efs"]
    },
    {
      "questionId": null,
      "questionText": "What are the four FSx (Third Party File System) types that you need to know for the exam?",
      "answerText": "Windows (fully managed Windows Share, supports NTFS and SMB), Lustre (Linux + Cluster, parallel file system optimized for Machine Learning, High Performance Compute), NetApp OnTap (managed ONTAP on AWS, broad compatibility), and OpenZFS (scales up to 1Million IOPS, 0.5ms latency, point in time clone).",
      "tags": ["fsx", "windows", "lustre", "netapp", "openzfs"],
      "domains": ["fsx", "aws-storage"]
    },
    {
      "questionId": null,
      "questionText": "What is FSx for Lustre and when should it be used?",
      "answerText": "FSx for Lustre is a parallel file system (large, very large) optimized for Machine Learning, video processing, financial models, electrical design automation, and High Performance Compute (HPC). Scales 100's GB/s, millions IOPS, sub-ms latency. Deploy options: Scratch (temporary, not replicated, no backup, high performance, 6x faster, 200 MB/s per TB) or Persistent (long term storage, replicated across AZ, replace failed file system within minutes).",
      "tags": ["fsx", "lustre", "hpc", "machine-learning"],
      "domains": ["fsx"]
    },
    {
      "questionId": null,
      "questionText": "What is Kinesis Data Stream and what are its key characteristics?",
      "answerText": "Kinesis Data Stream is for real-time data streaming. Producers send data to Kinesis Streams, which Consumers read from. Key characteristics: 365 days retention on stream, can be replayed, data cannot be deleted (MUST expire), up to 1MB message size (smaller payload is standard), order is guaranteed for data using partitionId, encryption: in-flight HTTPS/SSL, at rest KMS.",
      "tags": ["kinesis", "data-stream", "real-time", "streaming"],
      "domains": ["kinesis", "aws-streaming"]
    },
    {
      "questionId": null,
      "questionText": "What are the two Kinesis Data Stream capacity modes and their characteristics?",
      "answerText": "Provisioned Mode: any number of shards, each shard inbound 1MB/s or 1000 records/second, each shard outbound 2MB/s, scale manually, cost per shard provisioned. On Demand Mode: provisioned automatically (autoscaled), default capacity 4 (4MB/s, 4000 records/second), scales automatically based on observed throughput over past 30 days, pay per stream per hour and data in and out.",
      "tags": ["kinesis", "capacity-modes", "provisioned", "on-demand"],
      "domains": ["kinesis"]
    },
    {
      "questionId": null,
      "questionText": "What is Amazon Kinesis Firehose and how does it differ from Kinesis Data Stream?",
      "answerText": "Firehose collects data from producers and batches it, then flushes batch/queue periodically. It's fully managed, serverless, autoscales, pay what you use, near real-time (because of buffering). Key differences from Kinesis: loads streamed data to many destinations, fully managed (auto scaling), no storage, no replay, near real-time. Firehose can transform using Lambda at receiver, can write failed data to S3 bucket.",
      "tags": ["firehose", "kinesis", "streaming", "batch"],
      "domains": ["kinesis", "aws-streaming"]
    },
    {
      "questionId": null,
      "questionText": "What input and output formats does Kinesis Firehose support?",
      "answerText": "Input formats: CSV, JSON, Parquet, AVRO, text, binary. Output formats: Parquet/ORC, compression (gzip, snappy). Custom transformers use Lambda.",
      "tags": ["firehose", "data-formats", "parquet", "avro"],
      "domains": ["kinesis"]
    },
    {
      "questionId": null,
      "questionText": "What are common Kinesis troubleshooting issues related to throttling?",
      "answerText": "Throttling errors: check hot shard, look for micro spike, try randomizing partition key, exponential back-off, rate limit. Service limits and throughput exceptions can cause throttling. Shard partition distribution should send data evenly to shards.",
      "tags": ["kinesis", "troubleshooting", "throttling", "hot-shard"],
      "domains": ["kinesis"]
    },
    {
      "questionId": null,
      "questionText": "What is MSK (Amazon Managed Streaming for Kafka) and when should you use it vs Kinesis?",
      "answerText": "MSK is AWS Managed Streaming for Kafka. It's fully managed, deploys in your VPC multi-AZ (up to 3), auto recovery from common failures, data stored on EBS, supports custom configuration, can support up to 10MB message (Kinesis only 1MB), can retain data indefinitely (Kinesis only 365 days). Use MSK when you need larger messages, longer retention, or Kafka compatibility. Use Kinesis for AWS-native integration and simpler setup.",
      "tags": ["msk", "kafka", "kinesis", "streaming"],
      "domains": ["msk", "aws-streaming"]
    },
    {
      "questionId": null,
      "questionText": "What are the three MSK security authentication methods and which is best?",
      "answerText": "Mutual TLS (AuthN) + Kafka ACL (AuthZ) using certificates, SASL/SCRAM (AuthN) + Kafka ACL (AuthZ) using passwords, and IAM Access Control (AuthN + AuthZ) which is BEST. Everything uses in-flight TLS, at rest EBS encryption, network security groups. Kafka ACL are managed from within the instance making it a poor choice - IAM is better.",
      "tags": ["msk", "security", "authentication", "iam", "tls", "sasl"],
      "domains": ["msk", "security"]
    },
    {
      "questionId": null,
      "questionText": "What monitoring options are available for MSK?",
      "answerText": "CloudWatch Metrics: basic monitoring (cluster and broker), enhanced monitoring (++ enhanced broker message), topic level metrics. Prometheus (Open Source Monitoring): open port on cluster, broker, and topic, set up JMX export metrics on node exporter (CPU and disk metrics). Broker log delivery to CloudWatch, S3, or Kinesis.",
      "tags": ["msk", "monitoring", "cloudwatch", "prometheus"],
      "domains": ["msk"]
    },
    {
      "questionId": null,
      "questionText": "What is MSK Connect and how is it priced?",
      "answerText": "MSK Connect deploys Kafka Connect to MSK via plug-in. It moves data from Kafka to wherever (S3, other AWS services). AutoScale, no infrastructure, $0.11 per worker/hour.",
      "tags": ["msk", "msk-connect", "kafka-connect"],
      "domains": ["msk"]
    },
    {
      "questionId": null,
      "questionText": "What is MSK Serverless and what are its pricing components?",
      "answerText": "MSK Serverless is hands-free configuration where you define topics and number of partitions per topic. Security is IAM access control. Pricing: $0.75 per cluster hour ($558/month cluster), $0.0015 partition hour ($1.08 per month per partition), $0.10 GB storage per month, $0.10 ingress GB, $0.05 egress GB.",
      "tags": ["msk", "serverless", "pricing"],
      "domains": ["msk"]
    },
    {
      "questionId": null,
      "questionText": "What are the key differences between Kinesis and MSK in terms of message size, data organization, and encryption?",
      "answerText": "Kinesis: 1MB message size, data stream/shard, TLS in-flight. MSK: 10MB message size (1MB default), topic/partition, plain text or TLS. Both use KMS for at-rest encryption.",
      "tags": ["kinesis", "msk", "comparison", "message-size"],
      "domains": ["kinesis", "msk"]
    },
    {
      "questionId": null,
      "questionText": "What is the difference between ETL and ELT?",
      "answerText": "ETL (Extract, Transform, Load) is used with Data Warehouse - Schema-on-Write, transform data to meet schema requirements before loading. ELT (Extract, Load, Transform) is used with Data Lake - Schema-on-Read, extract and load data first, then transform on read.",
      "tags": ["etl", "elt", "data-warehouse", "data-lake"],
      "domains": ["data-pipeline"]
    },
    {
      "questionId": null,
      "questionText": "What is a Data Lakehouse and what are its advantages?",
      "answerText": "Data Lakehouse is best of both worlds (Data Warehouse and Data Lake). It can support ACID transactions. It combines the structure and query optimization of a warehouse with the flexibility and cost-effectiveness of a data lake.",
      "tags": ["data-lakehouse", "data-warehouse", "data-lake", "acid"],
      "domains": ["data-architecture"]
    },
    {
      "questionId": null,
      "questionText": "What are examples of structured, unstructured, and semi-structured data formats?",
      "answerText": "Structured: CSV, SQL Table, spreadsheet. Unstructured: text, video/audio, image, emails (requires preprocessing). Semi-Structured: JSON, XML, YAML, log files, email header records (structure may be inconsistent).",
      "tags": ["data-formats", "structured", "unstructured", "semi-structured"],
      "domains": ["data-ingestion"]
    },
    {
      "questionId": null,
      "questionText": "What is the difference between EBS gp2 and gp3?",
      "answerText": "gp2: IO increases as size increases (IO allocation increase so does disk size allocation). gp3: IO can increase independently of disk size. Both are general purpose EBS volume types.",
      "tags": ["ebs", "gp2", "gp3", "iops"],
      "domains": ["ebs"]
    },
    {
      "questionId": null,
      "questionText": "What are S3 Transfer Acceleration and Byte Range Fetch optimizations?",
      "answerText": "S3 Transfer Acceleration pushes to edge, edge pushes to target (supports multi-part). Byte Range Fetch optimizes reads by parallelizing read, higher fault tolerance, can be used for first byte only. If you know the size of the header, you can peek to get first header.",
      "tags": [
        "s3",
        "transfer-acceleration",
        "byte-range-fetch",
        "optimization"
      ],
      "domains": ["s3"]
    },
    {
      "questionId": null,
      "questionText": "What is the default behavior for EBS root drive deletion on termination?",
      "answerText": "Default behavior: root drive (drv0) will auto-delete, others (drv1) do not. This is DEFAULT and CAN BE OVERWRITTEN. This is an EXAM topic - know how to preserve root with EBS.",
      "tags": ["ebs", "root-drive", "delete-on-termination"],
      "domains": ["ebs"]
    },
    {
      "questionId": null,
      "questionText": "What are the EFS performance modes and throughput capabilities?",
      "answerText": "Performance mode set at config time. Burst 1TB ~= 50MiB/s + burst of 100MB/s. Elastic - autoscale increase/decrease (for unpredictable workloads). Up to 3 GB/s write. Performance mode cannot be changed after creation.",
      "tags": ["efs", "performance", "throughput", "burst"],
      "domains": ["efs"]
    },
    {
      "questionId": null,
      "questionText": "What is FSx for Windows and what are its key features?",
      "answerText": "FSx for Windows is a fully managed Windows Share (EXAM topic). Supports NTFS and SMB, can move with EC2 (different EC2 can connect), ACLs, user quotas, supports Microsoft's Distributed File System (DFS). Scales up to 10's GB/s, millions of IOPS, 1000's of petabytes. Storage options: SSD/HDD. Supports multiple AZ. Uses S3 for backups. Can connect via DirectConnect or VPN.",
      "tags": ["fsx", "windows", "ntfs", "smb"],
      "domains": ["fsx"]
    },
    {
      "questionId": null,
      "questionText": "What is FSx for NetApp OnTap and when should it be used?",
      "answerText": "FSx for NetApp OnTap is 'Managed ONTAP on AWS'. Features: move running workloads, broad compatibility (Mac, Linux, VMWare, Windows, AWS EC2/EKS/ECS), auto scale shrink/grow, snapshot low cost compression, point in time clones for workload transfers. EXAM may ask when to use this - 'Suppose xyz, which is the best fit FSx file system'.",
      "tags": ["fsx", "netapp", "ontap", "compatibility"],
      "domains": ["fsx"]
    },
    {
      "questionId": null,
      "questionText": "What are the Kinesis Producer Library (KPL) and Kinesis Client Library (KCL)?",
      "answerText": "KPL (Kinesis Producer Library) and KCL (Kinesis Client Library) are SDK libraries optimized for standard operations. Both are optimized for standard Kinesis operations. Messages can be managed through API, but client libraries are best practice.",
      "tags": ["kinesis", "kpl", "kcl", "sdk"],
      "domains": ["kinesis"]
    },
    {
      "questionId": null,
      "questionText": "What are common Kinesis consumer troubleshooting issues?",
      "answerText": "Read too slow: increase number of shards, MaxRecordPerCall may be too low, code is too slow. getRecords() returns empty: normal and expected, try again. Shard Iterator expired unexpectedly: more capacity on underlying DynamoDB. Record processor falling behind: increase returning, insufficient resources, monitor with get records.",
      "tags": ["kinesis", "troubleshooting", "consumer"],
      "domains": ["kinesis"]
    },
    {
      "questionId": null,
      "questionText": "What is Kinesis Data Analytics (Managed Service for Apache Flink)?",
      "answerText": "Flink replaces something leaner (Kinesis + SQL). Flink is Managed/Serverless. It's AWS Managed Service for Apache Flink (MSAF).",
      "tags": ["kinesis", "flink", "analytics", "msaf"],
      "domains": ["kinesis"]
    },
    {
      "questionId": null,
      "questionText": "What is the durability and availability of S3 storage classes?",
      "answerText": "All S3 storage classes have the same durability: 11-9's (the best). Availability depends on storage class: Standard (GP) 99.99% (4-9's, 53 minutes a year), Standard IA 99.9%, OneZone IA 99.5%. Availability is how rapidly available an item is.",
      "tags": ["s3", "durability", "availability", "storage-classes"],
      "domains": ["s3"]
    },
    {
      "questionId": null,
      "questionText": "What are the Glacier storage classes and their retrieval times?",
      "answerText": "Glacier Instant Retrieval: milliseconds, minimal storage time 90 days. Glacier Flexible Retrieval: Expedited (1-5 minutes), Standard (3-5 hours), Bulk (5-12 hours), min storage 90 days. Glacier Deep Archive: Standard retrieval (12 hours), Bulk (48 hours), min storage 180 days.",
      "tags": ["s3", "glacier", "retrieval-times", "archive"],
      "domains": ["s3"]
    }
  ]
}
